In [1]:
import pandas as pd
import numpy as np

In [2]:
nba = pd.read_csv('resources/nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

NOTE:
    1. NaN stands for Blank or null or missinh or empty value
    2. Age, Weight , Height columns are stored as integers inside csv file, BUT whenever pandas find a NaN values, it convert int to float

<h3>Shared Methods and Attributes between Series and DataFrames</h3>

In [3]:
nba.head(1)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [4]:
nba.tail(1)

    Name Team  Number Position  Age Height  Weight College  Salary
457  NaN  NaN     NaN      NaN  NaN    NaN     NaN     NaN     NaN

In [5]:
nba.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [6]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [7]:
nba.shape

(458, 9)

In [8]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [9]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [10]:
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [11]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

<h3>Differences between identical methods</h3>

In [12]:
rev = pd.read_csv('resources/revenue.csv', index_col='Date')
s =  pd.Series([1,2,3,4,5])
rev.head(3)

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933

In [13]:
rev.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [14]:
s.sum()

15

In [15]:
rev.sum(axis=1)

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

<h3>Select One Column from a DataFrame</h3>

Return type will be a Series

Below syntax will work only with valid python identifier, hence less preferable

In [16]:
nba.Name
nba.Number
nba.Salary

Output= None

Below will work all the time

In [17]:
nba['Name']
nba['Number']
nba['Salary']

Output=None

<h3>Select Two or More Columns from a DataFrame</h3>

Return type will be a DataFrame

In [18]:
nba[['Team','Name']].head(3)

             Team           Name
0  Boston Celtics  Avery Bradley
1  Boston Celtics    Jae Crowder
2  Boston Celtics   John Holland

<h3>Add New Column to DataFrame</h3>

In [19]:
nba['Sport'] = "Basketball"
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball

In [20]:
nba['League'] = 'National Basketball association'
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,League
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball,National Basketball association
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball,National Basketball association
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball,National Basketball association

Below is another syntax to do the same

In [21]:
nba = pd.read_csv('resources/nba.csv')
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [22]:
nba.insert(9, "Sport", "Basketball")

In [23]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball

In [24]:
nba.insert(7,"League","National Basketball association")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,League,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,National Basketball association,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,National Basketball association,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,National Basketball association,Boston University,NaN,Basketball

<h3>Broadcasting Operation</h3>

In [25]:
nba = pd.read_csv('resources/nba.csv')
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [26]:
nba["Age"].add(5).head()

# OR

# nba['Age'] + 5

0    30.0
1    30.0
2    32.0
3    27.0
4    34.0
Name: Age, dtype: float64

In [27]:
nba["Salary"].sub(50000).head()

# OR

# nba["Salary"] - 50000

0    7680337.0
1    6746117.0
2          NaN
3    1098640.0
4    4950000.0
Name: Salary, dtype: float64

In [28]:
nba['Weight in KG'] = nba['Weight'] * 0.453592
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in KG
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,81.64656
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,106.59412
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,92.98636

<h3>Review of value_count() method</h3>

value_count() method is only available for Pandas Series.

In [29]:
nba = pd.read_csv('resources/nba.csv')
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [30]:
nba['Team'].value_counts().head(2)

New Orleans Pelicans    19
Memphis Grizzlies       18
Name: Team, dtype: int64

In [31]:
nba['Position'].value_counts()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [32]:
nba['Weight'].value_counts().tail()

278.0    1
227.0    1
239.0    1
289.0    1
307.0    1
Name: Weight, dtype: int64

 <h3>Drop Rows with null Values</h3>

In [33]:
nba = pd.read_csv('resources/nba.csv')
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
nba.dropna(how='all', inplace=True) # how='any'
#use inplace to make change permanent inplace

In [35]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [36]:
nba.dropna(axis=1).head()

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

In [37]:
nba.dropna(subset=['Salary','College'])

output=None

<h3>Fill in Null Values with the .fillna() Method</h3>

applpying fillna() on DataFrame as a whole won't make sence in most cases because of difference in data tyes of columns. Instead apply fillna() on Series extracted from DataFrame

In [38]:
nba = pd.read_csv('resources/nba.csv')

In [39]:
nba['Salary'].fillna(0,inplace=True)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [40]:
nba['College'].fillna("No College", inplace=True)

In [41]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,No College,5000000.0

<h3>astype() method</h3>

Converts data type of a series from one type to another. It requires a Series to not have any null values.

In [42]:
nba= pd.read_csv('resources/nba.csv').dropna(how='all')
nba['Salary'].fillna(0, inplace= True)
nba['College'].fillna('No College', inplace=True)

nba.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,No College,5000000.0

In [43]:
# nba.dtypes
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    float64
dtypes: float64(4), object(5)
memory usage: 35.7+ KB

In [44]:
nba['Salary'] = nba['Salary'].astype('int64') # we dont have inplace parameter here

In [45]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0

In [46]:
nba['Number'] = nba['Number'].astype('int')

In [47]:
nba['Age'] = nba['Age'].astype('int')

In [48]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30,SG,27,6-5,205.0,Boston University,0

**category type reduces memory usage drastically. It is used if a column have a limited certail type of values like week name, month name etc**

In [49]:
nba['Position'] = nba['Position'].astype('category')

In [50]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    int32
 3   Position  457 non-null    category
 4   Age       457 non-null    int32
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    int64
dtypes: category(1), float64(1), int32(2), int64(1), object(4)
memory usage: 29.2+ KB

In [51]:
nba['Position'].nunique()

5

<h3>Sort a DataFrame with the .sort_values() Method</h3>

In [52]:
nba = pd.read_csv('resources/nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [53]:
nba.sort_values("Name", ascending=False)
nba.sort_values("Age", ascending=False)


output=None

In [54]:
nba.sort_values("Salary", na_position= 'first').head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
46,Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
171,Dahntay Jones,Cleveland Cavaliers,30.0,SG,35.0,6-6,225.0,Duke,NaN
264,Jordan Farmar,Memphis Grizzlies,4.0,PG,29.0,6-2,180.0,UCLA,NaN
269,Ray McCallum,Memphis Grizzlies,5.0,PG,24.0,6-3,190.0,Detroit,NaN
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
273,Alex Stepheson,Memphis Grizzlies,35.0,PF,28.0,6-10,270.0,USC,NaN
350,Briante Weber,Miami Heat,12.0,PG,23.0,6-2,165.0,Virginia Commonwealth,NaN
353,Dorell Wright,Miami Heat,11.0,SF,30.0,6-9,205.0,NaN,NaN
397,Axel Toupane,Denver Nuggets,6.0,SG,23.0,6-7,210.0,NaN,NaN

In [55]:
nba.sort_values(['Team','Name'], ascending=[True,False], inplace=True)

In [56]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
322,Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,NaN,1000000.0
310,Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0
321,Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,NaN,9756250.0
320,Thabo Sefolosha,Atlanta Hawks,25.0,SF,32.0,6-7,220.0,NaN,4000000.0
315,Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659.0

<h3>Sort DataFrame with the .sort_index() Method</h3>

In [57]:
nba = pd.read_csv('resources/nba.csv')

# first lets jumble

nba.sort_values(['Number','Salary','Name'], inplace=True)
nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
291,Orlando Johnson,New Orleans Pelicans,0.0,SG,27.0,6-5,220.0,UC Santa Barbara,55722.0
248,Andrew Goudelock,Houston Rockets,0.0,PG,27.0,6-3,200.0,Charleston,200600.0
347,Josh Richardson,Miami Heat,0.0,SG,22.0,6-6,200.0,Tennessee,525093.0
266,JaMychal Green,Memphis Grizzlies,0.0,PF,25.0,6-9,227.0,Alabama,845059.0
47,Isaiah Canaan,Philadelphia 76ers,0.0,PG,25.0,6-0,201.0,Murray State,947276.0
22,Shane Larkin,Brooklyn Nets,0.0,PG,23.0,5-11,175.0,Miami (FL),1500000.0
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
383,Darrell Arthur,Denver Nuggets,0.0,PF,28.0,6-9,235.0,Kansas,2814000.0
393,Emmanuel Mudiay,Denver Nuggets,0.0,PG,20.0,6-5,200.0,NaN,3102240.0
188,Andre Drummond,Detroit Pistons,0.0,C,22.0,6-11,279.0,Connecticut,3272091.0

In [58]:
nba.sort_index(ascending=False, inplace=True)

In [59]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0

<h3>Rank Values with the .rank() Method</h3>

Can be called on a Series to generate a brand new series of Rank

NOTE : First get rid of null values in the DataFrame

In [60]:
nba = pd.read_csv('resources/nba.csv').dropna(how='all')
nba['Salary'] = nba['Salary'].fillna(0).astype('int')
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0

Lets say we want to give 1 to the player having highest salary and so on..

In [61]:
nba['Salary Rank'] = nba["Salary"].rank(ascending=False).astype('int')
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337,97
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117,110
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0,452

In [62]:
nba.sort_values(by='Salary', ascending=False).head(5)

# Check the salary and rank assigned

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000,1
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500,2
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000,3
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364,4
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730,5

<h2>Filtering DataFrame</h2>

Lets import and clean our DatFrame first<br>

Cleaning that we will do is:
    1. convert 'Start Date' and 'Last Login Time' as date_time because these are just in string format
    2. Convert type of 'Senior Management' and 'Gender' columns to reduce memory usage

In [63]:
df = pd.read_csv('resources/employees.csv', parse_dates=['Start Date', 'Last Login Time'])

# df['Start Date'] = pd.to_datetime(df['Start Date'])
# df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

# Parsing columns seperately to datetime is not a very efficient technique. Instead, use 'parse_dates' attribute of read_csv()


df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df['Team'] = df['Team'].astype('category')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-05-06 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-05-06 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-05-06 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-05-06 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-05-06 16:47:00,101004,1.389,True,Client Services

In [64]:
df['Start Date'].head()

0   1993-08-06
1   1996-03-31
2   1993-04-23
3   2005-03-04
4   1998-01-24
Name: Start Date, dtype: datetime64[ns]

In [65]:
# df['Start Date'] = pd.to_datetime(df['Start Date'])

# df['Start Date'].head()

In [66]:
# df['Last Login Time'].head()

In [67]:
# df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [68]:
# df['Last Login Time'].head()

*NOTE* : Along with time, today's date is algo getting added.

In [69]:
# df['Senior Management'] = df['Senior Management'].astype('bool')

In [70]:
# df['Gender'] = df['Gender'].astype('category')

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.6+ KB

<h3>Filter a DataFrame Based on A Condition</h3>

In [72]:
df[df['Gender'] == 'Male']
output = None

In [73]:
df[df['Team']=='Finance']
output = None

In [74]:
df[df['Senior Management']]
output = None

In [75]:
mask =df['Team'] != 'Marketing'

df[mask]
output = None

In [76]:
df[df['Salary'] > 110000]
output = None

In [77]:
df[df['Start Date'] <= '1985-01-01'].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2020-05-06 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2020-05-06 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2020-05-06 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2020-05-06 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2020-05-06 20:49:00,57427,9.557,True,Client Services

In [78]:
mask1 = df['Gender'] == 'Male'
mask2 = df['Team'] == 'Marketing'

df[mask1 & mask2].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-05-06 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-05-06 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-05-06 07:45:00,37598,7.757,True,Marketing

In [79]:
mask1 = df['Senior Management']
mask2 = df['Start Date'] < '1990-01-01'

df[mask1 | mask2].tail()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
992,Anthony,Male,2011-10-16,2020-05-06 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-05-06 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-05-06 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-05-06 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2020-05-06 18:24:00,129949,10.169,True,Sales

In [80]:
mask1 = df['First Name'] == 'Robert'
mask2 = df['Team'] == 'Client Services'
mask3 = df['Start Date'] > '2016-06-01'

df[(mask1 & mask2) | mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2020-05-06 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2020-05-06 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2020-05-06 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2020-05-06 00:29:00,140002,19.490,True,Marketing

<h3>The isin() method</h3>

In [81]:
mask = df['Team'].isin(['Legal','Sales','Product','Marketing'])
df[mask]

output = None

<h3>The .isnull() and .notnull() Methods</h3>

In [82]:
df[df['Team'].isnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-05-06 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2020-05-06 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2020-05-06 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2020-05-06 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2020-05-06 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2020-05-06 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2020-05-06 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2020-05-06 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2020-05-06 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2020-05-06 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2020-05-06 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2020-05-06 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2020-05-06 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2020-05-06 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2020-05-06 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2020-05-06 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2020-05-06 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2020-05-06 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2020-05-06 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2020-05-06 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2020-05-06 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2020-05-06 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2020-05-06 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2020-05-06 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2020-05-06 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2020-05-06 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2020-05-06 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2020-05-06 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2020-05-06 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2020-05-06 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2020-05-06 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2020-05-06 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2020-05-06 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2020-05-06 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2020-05-06 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2020-05-06 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2020-05-06 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2020-05-06 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2020-05-06 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2020-05-06 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2020-05-06 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2020-05-06 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2020-05-06 05:19:00,143638,9.662,True,NaN

In [83]:
df[df['Gender'].notnull()].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-05-06 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-05-06 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-05-06 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-05-06 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-05-06 16:47:00,101004,1.389,True,Client Services

<h3>The .between() Method</h3>

In [84]:
df[df['Salary'].between(80000,90000)]

output = None

In [85]:
df[df['Bonus %'].between(2.0, 5.0)]
output = None

In [86]:
df[df['Start Date'].between('1991-01-01','1992-01-01')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
27,Scott,NaN,1991-07-11,2020-05-06 18:58:00,122367,5.218,False,Legal
75,Bonnie,Female,1991-07-02,2020-05-06 01:27:00,104897,5.118,True,Human Resources
88,Donna,Female,1991-11-27,2020-05-06 13:59:00,64088,6.155,True,Legal
116,NaN,Male,1991-06-22,2020-05-06 20:58:00,76189,18.988,True,Legal
148,Patrick,NaN,1991-07-14,2020-05-06 02:24:00,124488,14.837,True,Sales
166,NaN,Female,1991-07-09,2020-05-06 18:52:00,42341,7.014,True,Sales
172,Sara,Female,1991-09-23,2020-05-06 18:17:00,97058,9.402,False,Finance
220,NaN,Female,1991-06-17,2020-05-06 12:49:00,71945,5.560,True,Marketing
245,Victor,Male,1991-04-11,2020-05-06 07:44:00,70817,17.138,False,Engineering
277,Brenda,NaN,1991-05-29,2020-05-06 06:32:00,82439,19.062,False,Sales
313,Judy,Female,1991-07-01,2020-05-06 02:33:00,109510,13.457,True,Legal
328,Samuel,Male,1991-12-19,2020-05-06 02:54:00,76076,5.319,True,Finance
339,Michael,Male,1991-11-22,2020-05-06 12:57:00,98753,16.443,True,Human Resources
537,Cynthia,Female,1991-09-14,2020-05-06 13:08:00,51633,13.472,True,Business Development
552,Barbara,Female,1991-09-02,2020-05-06 15:41:00,127297,11.905,True,Product
603,Carl,NaN,1991-10-26,2020-05-06 08:11:00,100888,12.490,True,Business Development
639,Amanda,NaN,1991-08-11,2020-05-06 14:15:00,46665,19.391,True,Client Services
704,Thomas,Male,1991-09-07,2020-05-06 09:51:00,65251,11.211,False,Distribution
725,Jeremy,Male,1991-05-19,2020-05-06 13:40:00,131513,1.876,True,Finance
766,Justin,Male,1991-07-25,2020-05-06 00:45:00,112975,9.699,False,Human Resources
771,Peter,Male,1991-05-22,2020-05-06 01:39:00,102577,12.026,True,Product
783,NaN,NaN,1991-04-15,2020-05-06 03:39:00,132505,13.592,True,Product
891,Timothy,Male,1991-08-25,2020-05-06 10:37:00,92587,8.475,False,Finance
895,Janice,NaN,1991-11-19,2020-05-06 18:02:00,139791,16.968,False,Business Development
909,Donald,Male,1991-08-01,2020-05-06 02:25:00,61999,6.466,False,Product
923,Irene,NaN,1991-02-28,2020-05-06 22:23:00,135369,4.380,False,Business Development
989,Justin,NaN,1991-02-10,2020-05-06 16:58:00,38344,3.794,False,Legal

In [87]:
df[df['Last Login Time'].between('08:30AM','12:00PM')]
output = None

<h3>The .duplicated() Method</h3>

In [88]:
df.sort_values('First Name', inplace=True)

In [89]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-05-06 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2020-05-06 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-05-06 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2020-05-06 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2020-05-06 01:45:00,95327,15.120,False,Distribution

In [90]:
df[df['First Name'].duplicated()]

# this method has keep parameter, we can pass 'last', 'first', False

output = None

In [91]:
df[~df['First Name'].duplicated(keep= False)]

# output = None

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2020-05-06 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2020-05-06 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2020-05-06 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2020-05-06 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2020-05-06 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2020-05-06 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2020-05-06 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2020-05-06 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2020-05-06 10:30:00,132839,17.463,True,Client Services

<h3>The drop_duplicates() Method</h3>

In [92]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-05-06 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2020-05-06 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-05-06 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2020-05-06 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2020-05-06 01:45:00,95327,15.120,False,Distribution

In [93]:
len(df)

1000

In [94]:
len(df.drop_duplicates()) # Means - duplicate did not get removed

# works if whole row matches

1000

In [95]:
df.drop_duplicates(subset=['First Name'], keep='first')

output = None

In [96]:
df.drop_duplicates(subset=['First Name'], keep='last')

output = None

In [97]:
df.drop_duplicates(subset=['First Name'], keep=False)

output = None

In [98]:
df.drop_duplicates(subset=['Team'], keep=False)

# output = None

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

In [99]:
df.drop_duplicates(subset=['First Name', 'Team'], inplace=True)

len(df)

769

<h3>The .unique() and .nunique() Methods</h3>

Workd on Series

In [100]:
df = pd.read_csv('resources/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-05-06 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-05-06 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-05-06 11:17:00,130590,11.858,False,Finance

In [101]:
df['Gender'].unique()

[Male, Female, NaN]
Categories (2, object): [Male, Female]

In [102]:
df['Gender'].nunique()

2

In [103]:
df['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [104]:
len(df['Team'].unique())

11

In [105]:
df['Team'].nunique() # automatically drops null values

10

In [106]:
df['Team'].nunique(dropna=False)

11

**Let's now work with other data**

In [107]:
bond = pd.read_csv('resources/jamesbond.csv')
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

<h3>The .set_index() and .reset_index() Methods</h3>

set_index() is an alternative to inex_col parameter to read_csv method and many more<br>

reset_index() move back the column that we set as index and assign default index to DataFrame

In [108]:
bond.set_index('Film', inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [109]:
bond.reset_index(inplace=True, drop=False)
bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

NOTE : lets you set your index as 'Film' and again set as 'Year', 'Film' column will be removed from the DataFrame so be causious here, hence do reset_index first

<h3>Retrieve Rows by Index Label with .loc[]</h3>

NOTE : If your index is sorted, subsequent operation will be fast

In [110]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [111]:
bond.loc['Casino Royale']

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [112]:
bond.loc['Goldfinger']

Year                         1964
Actor                Sean Connery
Director             Guy Hamilton
Box Office                  820.4
Budget                       18.6
Bond Actor Salary             3.2
Name: Goldfinger, dtype: object

In [113]:
# bond.loc['Some Unknown key']

**Pandas DataFrame need not to have unique value in Key unlike Python Dictionary**

In [114]:
bond.loc['Diamonds Are Forever' : 'Moonraker']

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN

In [115]:
bond.loc['GoldenEye' :]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [116]:
bond.loc[['Moonraker','Octopussy']]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8

In [117]:
'DDLJ' in bond.index

False

<h3>Retrieve Rows by Index Position with .iloc[]</h3>

In [118]:
bond = pd.read_csv('resources/jamesbond.csv')
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [119]:
bond.iloc[15]
bond.loc[15]
# both will be same as we have numeric index here

Film                 A View to a Kill
Year                             1985
Actor                     Roger Moore
Director                    John Glen
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [120]:
bond.iloc[[15,20]]
bond.iloc[:4]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

In [121]:
bond.iloc[4:8]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8

In [122]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [123]:
bond.iloc[0]

Year                        1985
Actor                Roger Moore
Director               John Glen
Box Office                 275.2
Budget                      54.5
Bond Actor Salary            9.1
Name: A View to a Kill, dtype: object

In [124]:
bond.iloc[5:6]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6

<h3>Set New Values for a Specific Cell or Row</h3>

In [125]:
bond.loc['Dr. No', "Actor"] = "Salmaan Khan"

In [126]:
bond.loc['Dr. No']

Year                          1962
Actor                 Salmaan Khan
Director             Terence Young
Box Office                   448.8
Budget                           7
Bond Actor Salary              0.6
Name: Dr. No, dtype: object

In [127]:
bond.loc['Dr. No', ['Box Office','Budget','Bond Actor Salary']] = [448800000, 6000000,8000000]

In [128]:
bond.loc['Dr. No']

Year                          1962
Actor                 Salmaan Khan
Director             Terence Young
Box Office               4.488e+08
Budget                       6e+06
Bond Actor Salary            8e+06
Name: Dr. No, dtype: object

<h3>Set Multiple Values in DataFrame</h3>

In [129]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [130]:
mask = bond['Actor'] == 'Sean Connery'
bond.loc[mask, 'Actor'] = 'Sir Sean Connery' # this is view not a copy

In [131]:
bond['Actor']

Film
A View to a Kill                        Roger Moore
Casino Royale                          Daniel Craig
Casino Royale                           David Niven
Diamonds Are Forever               Sir Sean Connery
Die Another Day                      Pierce Brosnan
Dr. No                             Sir Sean Connery
For Your Eyes Only                      Roger Moore
From Russia with Love              Sir Sean Connery
GoldenEye                            Pierce Brosnan
Goldfinger                         Sir Sean Connery
Licence to Kill                      Timothy Dalton
Live and Let Die                        Roger Moore
Moonraker                               Roger Moore
Never Say Never Again              Sir Sean Connery
Octopussy                               Roger Moore
On Her Majesty's Secret Service      George Lazenby
Quantum of Solace                      Daniel Craig
Skyfall                                Daniel Craig
Spectre                                Daniel Craig
The Living Daylights                 Timothy Dalton
The Man with the Golden Gun             Roger Moore
The Spy Who Loved Me                    Roger Moore
The World Is Not Enough              Pierce Brosnan
Thunderball                        Sir Sean Connery
Tomorrow Never Dies                  Pierce Brosnan
You Only Live Twice                Sir Sean Connery
Name: Actor, dtype: object

<h3>Rename Index Labels or Columns in a DataFrame</h3>

In [132]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [133]:
bond.rename(columns={'Year' : 'Release Date', 'Box Office' : 'Revenue'}, inplace=True)

In [134]:
bond.head(1)

,Release Date,Actor,Director,Revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [135]:
bond.rename(index={'Dr No':"Doctor No"  , 'GoldenEye':'Golden Eye'}, inplace=True)

In [136]:
bond.head(10)

,Release Date,Actor,Director,Revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Golden Eye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [137]:
bond.loc['Golden Eye']

Release Date                    1995
Actor                 Pierce Brosnan
Director             Martin Campbell
Revenue                        518.5
Budget                          76.9
Bond Actor Salary                5.1
Name: Golden Eye, dtype: object

NOTE : we can use column attribute of DataFrame also to rename the columns, BUT will have to pass all values as column and index is immutable

In [138]:
bond.columns

Index(['Release Date', 'Actor', 'Director', 'Revenue', 'Budget',
       'Bond Actor Salary'],
      dtype='object')

In [139]:
bond.columns = ['Year of Release', 'Actor', 'Director', 'Gross', 'Budget', 'Salary']

In [140]:
bond.head()

,Year of Release,Actor,Director,Gross,Budget,Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

<h3>Delete Rows or Columns from a DataFrame</h3>

In [141]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [142]:
bond.drop('A View to a Kill').head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6

In [143]:
bond.drop(['Casino Royale', 'Die Another Day'], inplace=True)

In [144]:
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6

In [145]:
bond.drop('Box Office', axis=1, inplace=True)

**pop() method on dataframe deletes column and returns that deleted column as Series**

In [149]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)

In [148]:
bond.pop('Actor')

Film
A View to a Kill                      Roger Moore
Casino Royale                        Daniel Craig
Casino Royale                         David Niven
Diamonds Are Forever                 Sean Connery
Die Another Day                    Pierce Brosnan
Dr. No                               Sean Connery
For Your Eyes Only                    Roger Moore
From Russia with Love                Sean Connery
GoldenEye                          Pierce Brosnan
Goldfinger                           Sean Connery
Licence to Kill                    Timothy Dalton
Live and Let Die                      Roger Moore
Moonraker                             Roger Moore
Never Say Never Again                Sean Connery
Octopussy                             Roger Moore
On Her Majesty's Secret Service    George Lazenby
Quantum of Solace                    Daniel Craig
Skyfall                              Daniel Craig
Spectre                              Daniel Craig
The Living Daylights               Timothy Dalton
The Man with the Golden Gun           Roger Moore
The Spy Who Loved Me                  Roger Moore
The World Is Not Enough            Pierce Brosnan
Thunderball                          Sean Connery
Tomorrow Never Dies                Pierce Brosnan
You Only Live Twice                  Sean Connery
Name: Actor, dtype: object

In [150]:
del bond['Director']

In [151]:
del bond['Year']

In [152]:
bond.head()

                               Actor  Box Office  Budget  Bond Actor Salary
Film
A View to a Kill         Roger Moore       275.2    54.5                9.1
Casino Royale           Daniel Craig       581.5   145.3                3.3
Casino Royale            David Niven       315.0    85.0                NaN
Diamonds Are Forever    Sean Connery       442.5    34.7                5.8
Die Another Day       Pierce Brosnan       465.4   154.2               17.9

<h3>Create Random Sample with the .sample() Method</h3>

In [153]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [159]:
bond.sample(n=2) # returns random sample , brand new DataFrame

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN

In [161]:
bond.sample(frac=.10)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [162]:
bond.sample(n=3 , axis=1)

                                 Year  Box Office           Actor
Film
A View to a Kill                 1985       275.2     Roger Moore
Casino Royale                    2006       581.5    Daniel Craig
Casino Royale                    1967       315.0     David Niven
Diamonds Are Forever             1971       442.5    Sean Connery
Die Another Day                  2002       465.4  Pierce Brosnan
Dr. No                           1962       448.8    Sean Connery
For Your Eyes Only               1981       449.4     Roger Moore
From Russia with Love            1963       543.8    Sean Connery
GoldenEye                        1995       518.5  Pierce Brosnan
Goldfinger                       1964       820.4    Sean Connery
Licence to Kill                  1989       250.9  Timothy Dalton
Live and Let Die                 1973       460.3     Roger Moore
Moonraker                        1979       535.0     Roger Moore
Never Say Never Again            1983       380.0    Sean Connery
Octopussy                        1983       373.8     Roger Moore
On Her Majesty's Secret Service  1969       291.5  George Lazenby
Quantum of Solace                2008       514.2    Daniel Craig
Skyfall                          2012       943.5    Daniel Craig
Spectre                          2015       726.7    Daniel Craig
The Living Daylights             1987       313.5  Timothy Dalton
The Man with the Golden Gun      1974       334.0     Roger Moore
The Spy Who Loved Me             1977       533.0     Roger Moore
The World Is Not Enough          1999       439.5  Pierce Brosnan
Thunderball                      1965       848.1    Sean Connery
Tomorrow Never Dies              1997       463.2  Pierce Brosnan
You Only Live Twice              1967       514.2    Sean Connery

<h3>The .nsmallest() and .nlargest() Methods</h3>

In [163]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

Below is the brute force approach

In [164]:
bond.sort_values('Box Office', ascending=False).head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [167]:
bond.nlargest(n=3, columns='Box Office')

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [168]:
bond.nsmallest(n=2, columns='Box Office')

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [169]:
bond.nlargest(3, columns='Budget')

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5

In [170]:
bond.nsmallest(2, columns='Bond Actor Salary')

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6

*Can be applied on Series as well*

In [172]:
bond['Box Office'].nlargest(4)

Film
Skyfall        943.5
Thunderball    848.1
Goldfinger     820.4
Spectre        726.7
Name: Box Office, dtype: float64

In [173]:
bond['Year'].nsmallest(2)

Film
Dr. No                   1962
From Russia with Love    1963
Name: Year, dtype: int64

<h3>Filtering with the .where() Method</h3>

Returns a complete DataFrame with actual data where condition matches and NaN where condition does not match

In [174]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [176]:
mask = bond['Actor'] == 'Sean Connery'

In [178]:
bond.where(mask)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,1971.0,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN
Dr. No,1962.0,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,NaN,NaN,NaN,NaN,NaN,NaN
From Russia with Love,1963.0,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,NaN,NaN,NaN,NaN,NaN,NaN
Goldfinger,1964.0,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,NaN,NaN,NaN,NaN,NaN,NaN
Moonraker,NaN,NaN,NaN,NaN,NaN,NaN
Never Say Never Again,1983.0,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Octopussy,NaN,NaN,NaN,NaN,NaN,NaN
On Her Majesty's Secret Service,NaN,NaN,NaN,NaN,NaN,NaN
Quantum of Solace,NaN,NaN,NaN,NaN,NaN,NaN
Skyfall,NaN,NaN,NaN,NaN,NaN,NaN
Spectre,NaN,NaN,NaN,NaN,NaN,NaN
The Living Daylights,NaN,NaN,NaN,NaN,NaN,NaN
The Man with the Golden Gun,NaN,NaN,NaN,NaN,NaN,NaN
The Spy Who Loved Me,NaN,NaN,NaN,NaN,NaN,NaN
The World Is Not Enough,NaN,NaN,NaN,NaN,NaN,NaN
Thunderball,1965.0,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,NaN,NaN,NaN,NaN,NaN,NaN
You Only Live Twice,1967.0,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [181]:
mask2 = bond['Box Office'] > 800
bond.where(mask2)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,NaN,NaN,NaN,NaN,NaN,NaN
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN
Dr. No,NaN,NaN,NaN,NaN,NaN,NaN
For Your Eyes Only,NaN,NaN,NaN,NaN,NaN,NaN
From Russia with Love,NaN,NaN,NaN,NaN,NaN,NaN
GoldenEye,NaN,NaN,NaN,NaN,NaN,NaN
Goldfinger,1964.0,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,NaN,NaN,NaN,NaN,NaN,NaN
Moonraker,NaN,NaN,NaN,NaN,NaN,NaN
Never Say Never Again,NaN,NaN,NaN,NaN,NaN,NaN
Octopussy,NaN,NaN,NaN,NaN,NaN,NaN
On Her Majesty's Secret Service,NaN,NaN,NaN,NaN,NaN,NaN
Quantum of Solace,NaN,NaN,NaN,NaN,NaN,NaN
Skyfall,2012.0,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,NaN,NaN,NaN,NaN,NaN,NaN
The Living Daylights,NaN,NaN,NaN,NaN,NaN,NaN
The Man with the Golden Gun,NaN,NaN,NaN,NaN,NaN,NaN
The Spy Who Loved Me,NaN,NaN,NaN,NaN,NaN,NaN
The World Is Not Enough,NaN,NaN,NaN,NaN,NaN,NaN
Thunderball,1965.0,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,NaN,NaN,NaN,NaN,NaN,NaN
You Only Live Twice,NaN,NaN,NaN,NaN,NaN,NaN

In [183]:
mask3 = bond['Budget'] > 40

bond.where(mask & mask2 & mask3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,NaN,NaN,NaN,NaN,NaN,NaN
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN
Dr. No,NaN,NaN,NaN,NaN,NaN,NaN
For Your Eyes Only,NaN,NaN,NaN,NaN,NaN,NaN
From Russia with Love,NaN,NaN,NaN,NaN,NaN,NaN
GoldenEye,NaN,NaN,NaN,NaN,NaN,NaN
Goldfinger,NaN,NaN,NaN,NaN,NaN,NaN
Licence to Kill,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,NaN,NaN,NaN,NaN,NaN,NaN
Moonraker,NaN,NaN,NaN,NaN,NaN,NaN
Never Say Never Again,NaN,NaN,NaN,NaN,NaN,NaN
Octopussy,NaN,NaN,NaN,NaN,NaN,NaN
On Her Majesty's Secret Service,NaN,NaN,NaN,NaN,NaN,NaN
Quantum of Solace,NaN,NaN,NaN,NaN,NaN,NaN
Skyfall,NaN,NaN,NaN,NaN,NaN,NaN
Spectre,NaN,NaN,NaN,NaN,NaN,NaN
The Living Daylights,NaN,NaN,NaN,NaN,NaN,NaN
The Man with the Golden Gun,NaN,NaN,NaN,NaN,NaN,NaN
The Spy Who Loved Me,NaN,NaN,NaN,NaN,NaN,NaN
The World Is Not Enough,NaN,NaN,NaN,NaN,NaN,NaN
Thunderball,1965.0,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,NaN,NaN,NaN,NaN,NaN,NaN
You Only Live Twice,NaN,NaN,NaN,NaN,NaN,NaN

<h3>The .query() Method</h3>

This method works only when column name don't have space in bitween

In [184]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [185]:
bond.columns

Index(['Year', 'Actor', 'Director', 'Box Office', 'Budget',
       'Bond Actor Salary'],
      dtype='object')

In [186]:
bond.rename(columns={"Box Office":"Box_Office","Bond Actor Salary":"Bond_Actor_Salary"}, inplace=True)

# Pure Python Way

# bond.columns = [column_name.replace(" ","_") for column_name in bond.columns]


bond.head(1)

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [187]:
bond.query('Actor == "Sean Connery"')

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [188]:
bond.query("Director == 'Terence Young'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

In [190]:
bond.query("Box_Office > 600")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

In [191]:
bond.query("Actor == 'Roger Moore' and Director == 'John Glen' ")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8

<h3>A Review of the .apply() Method on Single Columns</h3>

In [197]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [200]:
def convert_to_string_and_add_millions(number):
    return str(number) + " MILLIONS!"

In [195]:
# bond['Box Office'] = bond['Box Office'].apply(convert_to_string_and_add_millions)
# bond['Budget'] = bond['Budget'].apply(convert_to_string_and_add_millions)

In [202]:
columns = ['Box Office', "Budget", 'Bond Actor Salary']
for col in columns:
    bond[col] = bond[col].apply(convert_to_string_and_add_millions)

In [203]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2 MILLIONS!,54.5 MILLIONS!,9.1 MILLIONS!
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5 MILLIONS!,145.3 MILLIONS!,3.3 MILLIONS!
Casino Royale,1967,David Niven,Ken Hughes,315.0 MILLIONS!,85.0 MILLIONS!,nan MILLIONS!

<h3>The .apply() Method with Row Values</h3>

In [204]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [205]:
def good_movie(row):
    
    actor = row[1]
    budget = row[4]
    
    if actor == 'Pierce Brosnan':
        return "The Best"
    elif actor == "Rojer Moore" and budget > 40:
        return "Enjoyable"
    else:
        return "I have no clue"
    
bond.apply(good_movie, axis=1)

Film
A View to a Kill                   I have no clue
Casino Royale                      I have no clue
Casino Royale                      I have no clue
Diamonds Are Forever               I have no clue
Die Another Day                          The Best
Dr. No                             I have no clue
For Your Eyes Only                 I have no clue
From Russia with Love              I have no clue
GoldenEye                                The Best
Goldfinger                         I have no clue
Licence to Kill                    I have no clue
Live and Let Die                   I have no clue
Moonraker                          I have no clue
Never Say Never Again              I have no clue
Octopussy                          I have no clue
On Her Majesty's Secret Service    I have no clue
Quantum of Solace                  I have no clue
Skyfall                            I have no clue
Spectre                            I have no clue
The Living Daylights               I have no clue
The Man with the Golden Gun        I have no clue
The Spy Who Loved Me               I have no clue
The World Is Not Enough                  The Best
Thunderball                        I have no clue
Tomorrow Never Dies                      The Best
You Only Live Twice                I have no clue
dtype: object

<h3>The .copy() Method</h3>

In [206]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [208]:
directors = bond['Director']
directors.head(3)

Film
A View to a Kill          John Glen
Casino Royale       Martin Campbell
Casino Royale            Ken Hughes
Name: Director, dtype: object

In [209]:
directors['A View to a Kill'] = "Mister John Glen"

C:\Users\Anand\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [210]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [211]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Mister John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

You can see that above operation changes the original DataFrame, sometime this is not the expected behaviour

In [212]:
bond = pd.read_csv('resources/jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [213]:
directors = bond['Director'].copy()
directors.head(1)

Film
A View to a Kill    John Glen
Name: Director, dtype: object

In [214]:
directors['A View to a Kill'] = " Minster John Glen"

directors.head(3)

Film
A View to a Kill     Minster John Glen
Casino Royale          Martin Campbell
Casino Royale               Ken Hughes
Name: Director, dtype: object

In [215]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN